## Условие лабораторной работы 5:

### Вариант 48. Создать файлы sh и bat, которые выполняют следующее:

На вход пакетному файлу приходит некоторое число, относительный путь к файлу (как параметр пакетного файла), содержащему строки, в каждой из которых написано через пробел целое число и строка. Необходимо рядом с исходным файлом создать файл с названием, совпадающим с текущей датой, и скопировать в него все строки из исходного файла, содержащие число большее либо равное заданному числу в качестве параметра.

## Цель работы:

- Освоить командные оболочки shell (для OS семейства Unix) и cmd (для OS семейства MS Windows):
    + изучить основные встроенные команды,
    + научиться писать файлы сценариев,
    + научиться соотносить командные оболочки для разных OS.
- Освоить командное окружение для OS семейства Unix(утилиты из пакета GNU Core Utilities), и соответствующие им утилиты для OS семейства MS Windows.

## Ход работы:

Используя материалы в интернете, я написал скрипты под windows и linux.

Код для Windows:

<img src="images/win.png" alt="Код для Windows">

Код для Linux:

<img src="images/lin.png" alt="Код для Linux">

#### Переменные:

Для Windows я добавил/использовал переменные:

- number - для параметра входного числа.
- file_path - для сохранения и последующего использования пути ко входному файлу.
- date - для получения текущей даты.
- i - для сохранения и последующего сравнения первой подстроки (числовой подстроки) из входного файла.
- j - для сохранения и последующего включения в выходной файл текстовой подстроки.

Для Linux я добавил/использовал переменные:

- number - для параметра входного числа.
- file_path - для сохранения и последующего использования пути ко входному файлу.
- date - для получения текущей даты.
- str_num - для сохранения и последующего сравнения числа в начале строки.
- line - для сохранения строки.

## Вывод

В ходе данной лабораторной работы я изучил основные встроенные команды, научился писать файлы сценариев, научился соотносить командные оболочки для разных OS, также освоил командное окружение Unix и MS Windows.
