# Лабораторная работа №1

### ЦЕЛЬ
- Познакомиться с системой верстки текстов TeX, языком верстки TeX, издательской системой LaTeX.Выполнить вариант индивидуального задания.

### Условие
- Сверстать три страницы научной статьи с использованием системы верстки текстов TeX.
- На странице [OSTIS Research Papers Collection (39-41)](https://proc.ostis.net/proc/Proceedings%20OSTIS-2024.pdf) необходимо взять доклад, соответствующий варианту индивидуального задания.

 [РЕЗУЛЬТАТ](file:///C:/%D0%90%D1%88%D1%83%D0%B9%D0%BA%D0%BE%20%D0%92/%D0%9F%D0%98%D0%92%D0%9E/lab1%20(1).pdf)

 # Лабораторная работа №3

### ЦЕЛЬ
- Познакомиться с программами git, освоить их программные аргументы.

### ВЫВОДЫ
- Научился на практике выполнять всевозможные действия с репозиторием и отвечать на теоретические вопросы из списка заданий.
- Получил практические навыки работы в консоли, использования консольных команд.

[РЕЗУЛЬТАТ](file:///C:/%D0%90%D1%88%D1%83%D0%B9%D0%BA%D0%BE%20%D0%92/%D0%9F%D0%98%D0%92%D0%9E/git%20%D0%BE%D1%82%D1%87%D1%91%D1%82.pdf)
